#Section01. 파일처리
## 1. 파이썬에서 파일 처리
### 파일열기 : open 함수

In [5]:
f=open('file.txt', 'rt', encoding='UTF8')
for line in f:
 print(line, end="")

작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17

###자동으로 파일 열고 닫기: with 문

In [6]:
with open("proverb.txt",'r', encoding='UTF8', newline='') as filereader:
  for row in filereader:
    print("{}".format(row.strip( )))

작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17

### 여러 파일 읽기: os와 glob 모듈
- ChatGPT랑 자주 노는 것을 추천
- 파일 경로 잡기, 파일 찾기 등 다양한 예제

In [7]:
import os
os.getcwd()

'C:\\Users\\Admin\\Desktop\\lgu6\\lab02\\chapter6'

In [8]:
import os
import glob

# 다중 csv, excel 파일이 존재 할 때,
# 형식이 똑같다고 전제하면, 하나의 데이터 프레임으로 변횐 할 때 관련 라이브러리 활용
for file in glob.glob(os.path.join('*.txt')):
  with open(file, 'r', newline='',encoding='UTF8') as filereader:
     for row in filereader:
      print("{}".format(row.strip( )))

작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17
안녕하세요
hello
내용을 추가합니다.
저장하는 문서 이름,  'w' 대신 'a'를 사용합니다.
작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17

### 문자열 공백/문자 제거: strip, lstrip, rstrip 함수

In [9]:
b1=" 작은 일에 성실한 사람은      큰일에도 성실하고 "
b1.strip( ) # 공백 제거

'작은 일에 성실한 사람은      큰일에도 성실하고'

In [10]:
text="....작은 일에 성실한 사람은, 큰일에도 성실하고...."
print(text.lstrip('.'))
print(text.rstrip('.'))
print(text.strip('.'))

작은 일에 성실한 사람은, 큰일에도 성실하고....
....작은 일에 성실한 사람은, 큰일에도 성실하고
작은 일에 성실한 사람은, 큰일에도 성실하고

###문자열 분리: split 함수

In [11]:
text="....작은 일에 성실한 사람은, 큰일에도 성실하고...."
print(text.split(", "))

['....작은 일에 성실한 사람은', '큰일에도 성실하고....']

In [12]:
numbers="1. 2. 3. 4. 5. 6"
result=numbers.split(". ")
print(result)

['1', '2', '3', '4', '5', '6']

###웹 페이지에서 CSV 파일 가져오기

In [76]:
import pandas as pd
titanic_df=pd.read_csv('https://raw.githubusercontent.com/sehakflower/data/main/titanic.csv')
titanic_df

                        PassengerId\tSurvived\tPclass\tName\tSex\tAge\tSibSp\tParch\tTicket\tFare\tCabin\tEmbarked
1\t0\t3\tBraund           Mr. Owen Harris\tmale\t22\t1\t0\tA/5 21171\t7...
2\t1\t1\tCumings          Mrs. John Bradley (Florence Briggs Thayer)\tf...
3\t1\t3\tHeikkinen        Miss. Laina\tfemale\t26\t0\t0\tSTON/O2. 31012...
4\t1\t1\tFutrelle         Mrs. Jacques Heath (Lily May Peel)\tfemale\t3...
5\t0\t3\tAllen            Mr. William Henry\tmale\t35\t0\t0\t373450\t8....
...                                                                    ...
152\t1\t1\tPears          Mrs. Thomas (Edith Wearne)\tfemale\t22\t1\t0\...
153\t0\t3\tMeo            Mr. Alfonzo\tmale\t55.5\t0\t0\tA.5. 11206\t8....
154\t0\t3\tvan Billiard   Mr. Austin Blyler\tmale\t40.5\t0\t2\tA/5. 851...
155\t0\t3\tOlsen          Mr. Ole Martin\tmale\t\t0\t0\tFa 265302\t7.31...
156\t0\t1\tWilliams       Mr. Charles Duane\tmale\t51\t0\t1\tPC 17597\t...

[156 rows x 1 columns]

###탭을 기준으로 분리하기

In [14]:
url='https://raw.githubusercontent.com/sehakflower/data/main/titanic.csv'
titanic_df=pd.read_csv(url,sep='\t')
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

###<여기서 잠깐> 데이터 분리하기

In [15]:
print('apple', 'banana')
print('apple', 'banana', sep='')
print('apple', 'banana', sep=' ')
print('apple', 'banana', sep=' ')
print('apple', 'banana', sep=' -> -> ')
print('apple', 'banana','eggs', 'ham')
print('apple', 'banana', 'eggs', 'ham', sep='\t')
print('apple', 'banana','eggs', 'ham', sep='\t\t')

apple banana
applebanana
apple banana
apple banana
apple -> -> banana
apple banana eggs ham
apple	banana	eggs	ham
apple		banana		eggs		ham

###엑셀 파일 가져오기

In [77]:
titanic='https://github.com/sehakflower/data/blob/main/titanic.xlsx?raw=true'
titanic=pd.read_excel(titanic,sheet_name='titanic3')
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

#Section 02. 데이터 처리
## 1. 데이터 살펴보기
### 앞뒤 데이터 보기: head, tail 함수

In [17]:
titanic_df.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [18]:
titanic_df.tail(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.0000,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

###데이터 개수/형태 확인하기: len/shape 함수

In [19]:
len(titanic_df) # 행의 개수

156

In [20]:
titanic_df.shape

(156, 12)

###데이터의 기본 통계치 보기: describe 함수

In [21]:
titanic_df.describe( )

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

### 결측치와 데이터형 확인하기: info 함수
- 분석 요령
- 결측지가 존재한다?
    + 해당 컬럼을 삭제할까? 말까?
    + 삭제를 안한다고 하면, 값을 어떻게 채울까? (핵심!!)
- 결측지를 처리한다 ==> 면접자가 질문을 합니다. 질문 : 왜 그렇게 처리를 했나요?
    + 답변 :  논리와 근거가 뒷받침이 되어야 함 ==> 스토리텔링

In [22]:
titanic_df.info( )

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Name         156 non-null    object
 4   Sex          156 non-null    object
 5   Age          126 non-null    float64
 6   SibSp        156 non-null    int64
 7   Parch        156 non-null    int64
 8   Ticket       156 non-null    object
 9   Fare         156 non-null    float64
 10  Cabin        31 non-null     object
 11  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

##2. 열/행 정리하기
###열 이름 변경하기

In [23]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [78]:
new_columns=['passengerId', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
'ticket', 'fare', 'cabin', 'embarked']
titanic_df.columns=new_columns
titanic_df.columns

ValueError: Length mismatch: Expected axis has 1 elements, new values have 12 elements

In [25]:
titanic_df

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

###데이터프레임 복사하기

In [26]:
# 공모전, 분석 프로젝트 진행할 때, 적절하게 아래 코드를 활용 copy()
# 데이터 조작, 핸들링, 원본 자체가 업데이트 될 수 있음
# 분석 단계 ==> 수집단계 / 가공단계 / 시각화(분석) 단게 / 모델링 단계
copy_titanic_df=titanic_df.copy( )
copy_titanic_df.head( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

###행 추가하기

In [31]:
import pandas as pd
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],

})

result = pd.concat([df1, df2])
result

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

In [37]:
# 메모 : pandas 1.x 버전에서만 사용, 2.x에서는 사용 불가 (append > concat)
new_df = pd.DataFrame({'passengerId':[1], 'survived':[1], 'pclass':[1], 'name':[1], 'sex':[1],
'age':[1], 'sibsp':[1], 'parch':[1], 'ticket':[1], 'fare':[1], 'cabin':[1],
'embarked':[1]})


pd.concat([copy_titanic_df, new_df])

'''
copy_titanic_df.append({'passengerId':1, 'survived':1, 'pclass':1, 'name':1, 'sex':1,
'age':1, 'sibsp':1, 'parch':1, 'ticket':1, 'fare':1, 'cabin':1,
'embarked':1}, ignore_index=True)
'''

"\ncopy_titanic_df.append({'passengerId':1, 'survived':1, 'pclass':1, 'name':1, 'sex':1,\n'age':1, 'sibsp':1, 'parch':1, 'ticket':1, 'fare':1, 'cabin':1,\n'embarked':1}, ignore_index=True)\n"

In [38]:
new_df = pd.DataFrame({'passengerId':[1], 'survived':[1], 'pclass':[1], 'name':[1], 'sex':[1],
'age':[1], 'sibsp':[1], 'parch':[1], 'ticket':[1], 'fare':[1], 'cabin':[1],
'embarked':[1]})

pd.concat([copy_titanic_df, new_df])

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C
0,1,1,1,1,1,1.0,1,1,1,1.0000,1,1

In [ ]:
copy_titanic_df.tail( )

In [ ]:
copy_titanic_df=copy_titanic_df.append({'passengerId':1, 'survived':1, 'pclass':1,
'name':1, 'sex':1, 'age':1, 'sibsp':1, 'parch':1, 'ticket':1, 'fare':1, 'cabin':1,
'embarked':1}, ignore_index=True)
copy_titanic_df.tail( )

###열 추가하기

In [39]:
copy_titanic_df['gender']=1
copy_titanic_df.tail( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,gender
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S,1
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S,1
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,1
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S,1
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C,1

In [40]:
# 새로운 컬럼 추가 하는 방식
copy_titanic_df.loc[copy_titanic_df['sex']=='female', 'gender']

1      1
2      1
3      1
8      1
9      1
10     1
11     1
14     1
15     1
18     1
19     1
22     1
24     1
25     1
28     1
31     1
32     1
38     1
39     1
40     1
41     1
43     1
44     1
47     1
49     1
52     1
53     1
56     1
58     1
61     1
66     1
68     1
71     1
79     1
82     1
84     1
85     1
88     1
98     1
100    1
106    1
109    1
111    1
113    1
114    1
119    1
123    1
128    1
132    1
133    1
136    1
140    1
141    1
142    1
147    1
151    1
Name: gender, dtype: int64

In [41]:
# 분석과 관련 코드
# 인코딩 변환
# 통계 알고리즘, 머신러닝 알고리즘 ==> 수학 공식
# 수학 공식에서 문자열이 작동 (x)
# 문자열을 활용하고 싶음 ==> 적절한 방식으로 변환
copy_titanic_df.loc[copy_titanic_df['sex']=='female', 'gender']=0
copy_titanic_df.head( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,gender
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

##3. 인덱스 정리하기
###index 속성

In [ ]:
titanic_df.index

###values 속성

In [ ]:
titanic_df.values

###열 추출하기

In [ ]:
age=titanic_df['age'] # Series 객체는 1차원 배열(ndarray)과 호환됨
print(type(age))
age

##4. 데이터 정렬하기
###인덱스 기준으로 정렬하기

In [ ]:
titanic_df.sort_index( )

###열 기준으로 정렬하기

In [ ]:
# 자주 활용
titanic_df.sort_values(by='age') # 오름차순 정렬
titanic_df.sort_values(by='age', ascending=False) # 내림차순 정렬

In [ ]:
titanic_df.sort_values(by=['age', 'pclass']) # 오름차순 정렬
titanic_df.sort_values(by=['age', 'pclass'], ascending=False) # 내림차순 정렬

###<여기서 잠깐>KeyError

In [ ]:
titanic_df[0] # KeyError
titanic_df[3,1] # KeyError
titanic_df[3,:] # KeyError

##5. 데이터 가져오기
### 지정 범위의 행에서 데이터 가져오기

In [ ]:
titanic_df[0:5] # titanic_df.head(  )와 실행 결과 동일함
titanic_df[0:1] # 첫 행만 가져오기
titanic_df[::3] # 3개씩 건너서 출력함
titanic_df[::-1] # 행의 순서를 거꾸로 출력함

###단순 인덱스로 범위 지정해 데이터 가져오기

In [ ]:
titanic_df[:3]

###지정 범위의 열에서 데이터 가져오기

In [ ]:
len(titanic_df.columns)

In [ ]:
# 왜 이런 코드를 칠 것인가? ==> 자동화
titanic_df[titanic_df.columns[0]] # 첫 번째(0번) 열을 1차원 배열의 Series 객체로 추출

In [ ]:
titanic_df[titanic_df.columns[11]] # 마지막 열을 1차원 배열의 Series 객체로 추출
# titanic_df[titanic_df.columns[-1]] # 혹은 [-1]로 표시

###열 이름으로 데이터 가져오기

In [ ]:
age=titanic_df['age']
print(type(age))

In [ ]:
titanic_df['age'] # 'age' 열을 1차원 배열인 Series 객체로 추출
titanic_df.age

###열 이름과 위치를 이용해 데이터 가져오기

In [ ]:
# 평소에 이렇게 작업하는 것은 비추
# 전처리 자동화 함수를 만든다거나 할 때, 고려 할 사항
print(titanic_df[titanic_df.columns[0]][0]) # 첫 번째 열의 첫 번째 값
print(titanic_df['age'][0]) # age 열의 첫 번째 값
print(titanic_df[titanic_df.columns[0]][2])
print(titanic_df[titanic_df.columns[-1]][0])
type(titanic_df[titanic_df.columns[0]][0]) # str

In [ ]:
titanic_df[titanic_df.columns[0]][2:6] # 2번부터 5번 행까지
titanic_df[titanic_df.columns[0]][:-1] # 마지막 행 제외
titanic_df[titanic_df.columns[0]][::3] # 3개의 step으로 슬라이싱
titanic_df[titanic_df.columns[0]][-1:] # 마지막 행만 추출
titanic_df[titanic_df.columns[0]][::-1] # 행을 역순으로 출력

In [42]:
titanic_df['pclass'] # 반환객체는 시리즈
titanic_df[['pclass']] # 반환객체는 데이터 프레임

     pclass
0         3
1         1
2         3
3         1
4         3
..      ...
151       1
152       3
153       3
154       3
155       1

[156 rows x 1 columns]

In [ ]:
titanic_df[['pclass', 'name', 'sex']] # DataFrame 추출

# 매우 비추
titanic_df[[titanic_df.columns[2],titanic_df.columns[3],titanic_df.columns[4]]]
 # DataFrame 추출

In [ ]:
titanic_df[[titanic_df.columns[2],titanic_df.columns[3],titanic_df.columns[4]]][2:15:3]
# 슬라이싱

In [ ]:
print(titanic_df[titanic_df.columns[0]][0])
print(titanic_df[titanic_df.columns[0]][2])
# print(titanic_df[titanic_df.columns[0]][-1]) # 실행 시 오류 발생
type(titanic_df[titanic_df.columns[0]][0])

###인덱스 이름을 기준으로 데이터 가져오기: loc 속성

In [51]:
temp_df = titanic_df.set_index('name')
temp_df

,passengerId,survived,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Pears, Mrs. Thomas (Edith Wearne)",152,1,1,female,22.0,1,0,113776,66.6000,C2,S
"Meo, Mr. Alfonzo",153,0,3,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
"van Billiard, Mr. Austin Blyler",154,0,3,male,40.5,0,2,A/5. 851,14.5000,NaN,S
"Olsen, Mr. Ole Martin",155,0,3,male,NaN,0,0,Fa 265302,7.3125,NaN,S
"Williams, Mr. Charles Duane",156,0,1,male,51.0,0,1,PC 17597,61.3792,NaN,C

In [50]:
temp_df.iloc[0]

passengerId            1
survived               0
pclass                 3
sex                 male
age                 22.0
sibsp                  1
parch                  0
ticket         A/5 21171
fare                7.25
cabin                NaN
embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [52]:
temp_df.loc['Braund, Mr. Owen Harris':'Williams, Mr. Charles Duane']

,passengerId,survived,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Pears, Mrs. Thomas (Edith Wearne)",152,1,1,female,22.0,1,0,113776,66.6000,C2,S
"Meo, Mr. Alfonzo",153,0,3,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
"van Billiard, Mr. Austin Blyler",154,0,3,male,40.5,0,2,A/5. 851,14.5000,NaN,S
"Olsen, Mr. Ole Martin",155,0,3,male,NaN,0,0,Fa 265302,7.3125,NaN,S
"Williams, Mr. Charles Duane",156,0,1,male,51.0,0,1,PC 17597,61.3792,NaN,C

In [53]:
titanic_df.loc[0:5]

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [ ]:
titanic_df.loc[0:10:2]

In [54]:
# loc 문법 정석
titanic_df.loc[:, 'age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: age, Length: 156, dtype: float64

In [55]:
titanic_df.loc[:, ['age', 'sex']]

      age     sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
151  22.0  female
152  55.5    male
153  40.5    male
154   NaN    male
155  51.0    male

[156 rows x 2 columns]

In [56]:
titanic_df.loc[3:7, ['age', 'sex']]

    age     sex
3  35.0  female
4  35.0    male
5   NaN    male
6  54.0    male
7   2.0    male

In [57]:
titanic_df.loc[2:5, 'survived':'age']

,survived,pclass,name,sex,age
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0
5,0,3,"Moran, Mr. James",male,NaN

###인덱스 순서를 기준으로 데이터 가져오기: iloc 속성

In [ ]:
titanic_df.iloc[0]

In [ ]:
titanic_df.iloc[0:5]

In [ ]:
titanic_df.iloc[0:10:3]

In [ ]:
titanic_df.iloc[:, [0, 2]]

In [ ]:
titanic_df.iloc[1:5, [0, 2]]

In [ ]:
titanic_df.iloc[1:5, 1:4]

###피벗 테이블을 이용해 데이터 가져오기

In [59]:
import seaborn as sns
import pandas as pd

tips =sns.load_dataset('tips')
pivot_df = pd.pivot_table(
    tips,
    values ='tip',
    index='sex',
    columns='smoker',
    aggfunc='mean',
    observed=True
)
pivot_df

smoker       Yes        No
sex
Male    3.051167  3.113402
Female  2.931515  2.773519

## 대기업 분석가 희망자 프로그래밍 우선 순위
1. SQL ==> GroupBy, 서브쿼리, 원도우함수
2. Excel
3. 회사에서 주로 쓰는 도구(Python, R, Tableau, PowrBi, etc)

In [61]:
tips.groupby(['sex','smoker'],observed=True)['tip'].mean().unstack()

smoker       Yes        No
sex
Male    3.051167  3.113402
Female  2.931515  2.773519

In [63]:
titanic_df.pivot_table(index='pclass', columns='sex', values='survived')

sex       female      male
pclass
1       1.000000  0.142857
2       0.916667  0.166667
3       0.571429  0.131148

In [65]:
# 주피터 노트북 사용자
!pip install numpy

Requirement already satisfied: numpy in c:\users\admin\desktop\lgu6\venv\lib\site-packages (2.2.4)

In [66]:
import numpy as np # mean 함수를 사용하기 위해 numpy를 import

# aggfunc에서 여러분이 정의한 사용자 정의함수(udf)도 추가할 수 있음
titanic_df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc=np.mean)

C:\Users\Admin\AppData\Local\Temp\ipykernel_17768\2839371757.py:2: FutureWarning: The provided callable <function mean at 0x000001957EEEEB60> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  titanic_df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc=np.mean)

sex       female      male
pclass
1       1.000000  0.142857
2       0.916667  0.166667
3       0.571429  0.131148

In [ ]:
import numpy as np
titanic_df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc=np.sum)

###그룹으로 묶어서 데이터 가져오기

In [67]:
titanic_df.head( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 분석 할 때 기준 변수 : 종속변수 선정
- 종속변수 선정이 분석 주제와 직접적인 연관성이 있다고 보면 됨

In [71]:
# survived를 기준점으로 심었을까?
titanic_df.groupby('survived').count( ) # 결측치 체크하고 싶을 때 활용

,passengerId,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
survived,,,,,,,,,,,
0,102,102,102,102,85,102,102,102,102,14,102
1,54,54,54,54,41,54,54,54,54,17,53

In [70]:
titanic_df.groupby('survived').mean( )

TypeError: agg function failed [how->mean,dtype->object]

In [72]:
titanic_df.groupby('sex').sum( )

,passengerId,survived,pclass,name,age,sibsp,parch,ticket,fare,cabin,embarked
sex,,,,,,,,,,,
female,3815,40,138,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1150.00,49,29,PC 17599STON/O2. 3101282113803347742237736PP 9...,1593.7958,C85C123G6C103B78D33B28F33C23 C25 C27E101F E69D...,CSSSCSSSSSCQSSQCQSCSSCQQSCSSSSSSSQSSSSSSQCSCSS...
male,8431,14,240,"Braund, Mr. Owen HarrisAllen, Mr. William Henr...",2395.83,47,33,A/5 2117137345033087717463349909A/5. 215134708...,2791.2998,E46D56A6C23 C25 C27B30C52C83F G73E31A5D10 D12D...,SSQSSSSQSSSSCSSCSCSCSCSQCSSCSCSCSSCCSSSSCSSSSS...

In [73]:
titanic_df.groupby('sex')['survived'].mean( )

sex
female    0.714286
male      0.140000
Name: survived, dtype: float64

In [74]:
# 에러 메시지가 암시하는 것은 중간에 데이터 값 자체가 살짝 문자 타입과 숫자 타입이 혼용되어 있는 상태
titanic_df.groupby(['sex', 'survived']).mean( )

TypeError: agg function failed [how->mean,dtype->object]

##6. 데이터 재구조화하기
###stack과 unstack

In [79]:
tips.head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

In [83]:
df2 = tips.groupby(['sex', 'size'], observed=True)['tip'].mean()
df2.unstack('sex')

sex       Male    Female
size
1     1.920000  1.276667
2     2.614184  2.528448
3     3.476667  3.250000
4     4.172143  4.021111
5     3.750000  5.140000
6     5.850000  4.600000

In [75]:
df = titanic_df.groupby(['sex', 'survived']).mean()
df

TypeError: agg function failed [how->mean,dtype->object]

In [85]:
df.unstack('sex')

NameError: name 'df' is not defined

In [ ]:
df.unstack('survived')

In [ ]:
survived=df.unstack('survived')
survived_stack=survived.stack('survived')
survived_stack

### 인덱스 초기화하기: reset_index 함수
- 조건 필터링 이후에 reset_index(drop=True
- groupby 연산 이후에, 멀티인덱스 현상이 발생하니깐, 깔끔하게 데이터프레임으로 만들기 위해서 reset_index()

In [84]:
df1=df.reset_index( )
df1

NameError: name 'df' is not defined

In [ ]:
# 잘 활용하지 않음 ==> 객체 업데이트를 아예 해버림, 재 실행 시, 안될 가능성이 높음
# result = dataframe.어쩌고
df.reset_index(inplace=True)
df

## 7. 데이터프레임 합치기

In [86]:
import pandas as pd
url='https://github.com/sehakflower/data/blob/main/titanic_1309.xlsx?raw=true'
titanic=pd.read_excel(url, sheet_name='total')
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [88]:
# 행으로 분리
# 1000개의 훈련데이터
# 309개의 테스트 데이터
# 훈련/테스트 이 개념은 5월 머신러닝/딥러닝 수업 때 다룸
train_1000=titanic.iloc[:1000]
test_309=titanic.iloc[1000:]
len(train_1000), len(test_309)

(1000, 309)

### 파일 내보내기
- dataset 파일 폴더 내부로 보내기

In [89]:
train_1000.to_csv('dataset/train_1000.csv')
test_309.to_csv('dataset/test_309.csv')

In [92]:
pwd

'C:\\Users\\Admin\\Desktop\\lgu6\\lab02\\chapter6'

In [93]:
ls

 C ����̺��� �������� �̸��� �����ϴ�.
 ���� �Ϸ� ��ȣ: 1C12-191A

 C:\Users\Admin\Desktop\lgu6\lab02\chapter6 ���͸�

2025-04-03  ���� 03:44    <DIR>          .
2025-04-03  ���� 03:44    <DIR>          ..
2025-04-03  ���� 12:21    <DIR>          .ipynb_checkpoints
2025-04-03  ���� 03:44           318,394 Chapter 06_�Ǵٽ��� Ȱ���� ������ ��ó�� 1.ipynb
2025-04-03  ���� 03:43    <DIR>          dataset
2023-06-19  ���� 02:57               284 file.txt
2025-04-02  ���� 04:49             1,177 file_io.ipynb
2023-06-19  ���� 02:57               117 hello.txt
2023-06-19  ���� 02:57               284 proverb.txt
               5�� ����             320,256 ����Ʈ
               4�� ���͸�  432,656,654,336 ����Ʈ ����

In [95]:
pd.read_csv('dataset/train_1000.csv')

,Unnamed: 0,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,995,3,0,"Markoff, Mr. Marin",male,35.0000,0,0,349213,7.8958,NaN,C,NaN,NaN,NaN
996,996,3,0,"Markun, Mr. Johann",male,33.0000,0,0,349257,7.8958,NaN,S,NaN,NaN,NaN
997,997,3,1,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,C,NaN,NaN
998,998,3,0,"Matinoff, Mr. Nicola",male,NaN,0,0,349255,7.8958,NaN,C,NaN,NaN,NaN
999,999,3,1,"McCarthy, Miss. Catherine ""Katie""",female,NaN,0,0,383123,7.7500,NaN,Q,15 16,NaN,NaN

###데이터 합치기: concat 함수

In [96]:
total_df=pd.concat([train_1000, test_309]) # 옵션 없으면 axis=0
total_df=pd.concat([train_1000, test_309], axis=0) # 위아래로 붙일 때는 axis=0
total_df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [98]:
total_df=pd.concat([train_1000, test_309])
total_df=pd.concat([train_1000, test_309], axis=1)
total_df.shape

(1309, 28)

### 데이터프레임 병합 : merge 함수
- join에러가 발생 대체
   + 방법1. 매개변수 설명 참조 후 ChatGPT 도움
   + 방법2. merge나 join 하기전에 key값 컬럼명을 통일 시킴

In [107]:
df1 = pd.DataFrame({
    'key': ['K0', 'K1', 'K2'],
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'key': ['K0', 'K2', 'K3'],
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
})


# pandas : merge, join
# Inner merge
result1 = pd.merge(df1,df2, on = 'key', how='inner')
print("inner join")
print(result1)
print('\n')

# left merge
result2 = pd.merge(df1, df2, on ='key', how='left')
print("left join")
print(result2)
print('\n')

# Right merge
result3 = pd.merge(df1, df2, on ='key', how='right')
print("right join")
print(result3)
print('\n')

# full merge
result4 = pd.merge(df1, df2, on ='key', how='outer') #full join
print("full join")
print(result4)
print('\n')

inner join
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2


left join
  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2


right join
  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3  NaN  NaN  C3  D3


full join
  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3  NaN  NaN   C3   D3

In [108]:
df1=train_1000[['name', 'pclass', 'sex', 'age']]
df1

                                                name  pclass     sex      age
0                      Allen, Miss. Elisabeth Walton       1  female  29.0000
1                     Allison, Master. Hudson Trevor       1    male   0.9167
2                       Allison, Miss. Helen Loraine       1  female   2.0000
3               Allison, Mr. Hudson Joshua Creighton       1    male  30.0000
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  female  25.0000
..                                               ...     ...     ...      ...
995                               Markoff, Mr. Marin       3    male  35.0000
996                               Markun, Mr. Johann       3    male  33.0000
997                          Masselmani, Mrs. Fatima       3  female      NaN
998                             Matinoff, Mr. Nicola       3    male      NaN
999                McCarthy, Miss. Catherine "Katie"       3  female      NaN

[1000 rows x 4 columns]

In [109]:
df2=train_1000[['name', 'survived']]
df2

                                                name  survived
0                      Allen, Miss. Elisabeth Walton         1
1                     Allison, Master. Hudson Trevor         1
2                       Allison, Miss. Helen Loraine         0
3               Allison, Mr. Hudson Joshua Creighton         0
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)         0
..                                               ...       ...
995                               Markoff, Mr. Marin         0
996                               Markun, Mr. Johann         0
997                          Masselmani, Mrs. Fatima         1
998                             Matinoff, Mr. Nicola         0
999                McCarthy, Miss. Catherine "Katie"         1

[1000 rows x 2 columns]

In [110]:
merge_inner=pd.merge(df1, df2)
merge_inner

,name,pclass,sex,age,survived
0,"Allen, Miss. Elisabeth Walton",1,female,29.0000,1
1,"Allison, Master. Hudson Trevor",1,male,0.9167,1
2,"Allison, Miss. Helen Loraine",1,female,2.0000,0
3,"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000,0
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,0
...,...,...,...,...,...
999,"Markoff, Mr. Marin",3,male,35.0000,0
1000,"Markun, Mr. Johann",3,male,33.0000,0
1001,"Masselmani, Mrs. Fatima",3,female,NaN,1
1002,"Matinoff, Mr. Nicola",3,male,NaN,0
1003,"McCarthy, Miss. Catherine ""Katie""",3,female,NaN,1

In [112]:
df2.loc[[0,2,3], ['name']] = '' # 중간에 특정 행의 빈 셀 제거
df2

                                              name  survived
0                                                          1
1                   Allison, Master. Hudson Trevor         1
2                                                          0
3                                                          0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)         0
5                              Anderson, Mr. Harry         1
6                Andrews, Miss. Kornelia Theodosia         1
7                           Andrews, Mr. Thomas Jr         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)         1
9                          Artagaveytia, Mr. Ramon         0

In [111]:
df2.loc[[0,2,3], ['name']] = ''
df2=df2[:10]
df1=df1[:10]
merge_inner=pd.merge(df1, df2, how='inner', on='name')
merge_inner

,name,pclass,sex,age,survived
0,"Allison, Master. Hudson Trevor",1,male,0.9167,1
1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,0
2,"Anderson, Mr. Harry",1,male,48.0000,1
3,"Andrews, Miss. Kornelia Theodosia",1,female,63.0000,1
4,"Andrews, Mr. Thomas Jr",1,male,39.0000,0
5,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,female,53.0000,1
6,"Artagaveytia, Mr. Ramon",1,male,71.0000,0

In [113]:
merge_outer = pd.merge(df1,df2, how='outer',on='name')
merge_outer

,name,pclass,sex,age,survived
0,,NaN,NaN,NaN,1.0
1,,NaN,NaN,NaN,0.0
2,,NaN,NaN,NaN,0.0
3,"Allen, Miss. Elisabeth Walton",1.0,female,29.0000,NaN
4,"Allison, Master. Hudson Trevor",1.0,male,0.9167,1.0
5,"Allison, Miss. Helen Loraine",1.0,female,2.0000,NaN
6,"Allison, Mr. Hudson Joshua Creighton",1.0,male,30.0000,NaN
7,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1.0,female,25.0000,0.0
8,"Anderson, Mr. Harry",1.0,male,48.0000,1.0
9,"Andrews, Miss. Kornelia Theodosia",1.0,female,63.0000,1.0
10,"Andrews, Mr. Thomas Jr",1.0,male,39.0000,0.0
11,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1.0,female,53.0000,1.0
12,"Artagaveytia, Mr. Ramon",1.0,male,71.0000,0.0

In [ ]:
merge_left=pd.merge(df1, df2, how='left', left_on='name', right_on='name')
merge_left

In [ ]:
merge_right=pd.merge(df1, df2, how='right', left_on='name', right_on='name')
merge_right

###데이터프레임 결합  : join 함수

In [114]:
df2.loc[[1], ['name']]='Kildong, Mr. Hong'
df2=df2[:10]
df2

                                              name  survived
0                                                          1
1                                Kildong, Mr. Hong         1
2                                                          0
3                                                          0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)         0
5                              Anderson, Mr. Harry         1
6                Andrews, Miss. Kornelia Theodosia         1
7                           Andrews, Mr. Thomas Jr         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)         1
9                          Artagaveytia, Mr. Ramon         0

In [116]:
df1.set_index('name', inplace=True)
df2.set_index('name', inplace=True)

KeyError: "None of ['name'] are in the columns"

In [117]:
df1

                                                 pclass     sex      age
name
Allen, Miss. Elisabeth Walton                         1  female  29.0000
Allison, Master. Hudson Trevor                        1    male   0.9167
Allison, Miss. Helen Loraine                          1  female   2.0000
Allison, Mr. Hudson Joshua Creighton                  1    male  30.0000
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  female  25.0000
Anderson, Mr. Harry                                   1    male  48.0000
Andrews, Miss. Kornelia Theodosia                     1  female  63.0000
Andrews, Mr. Thomas Jr                                1    male  39.0000
Appleton, Mrs. Edward Dale (Charlotte Lamson)         1  female  53.0000
Artagaveytia, Mr. Ramon                               1    male  71.0000

In [ ]:
df2

In [118]:
# join 함수 문법
df1.join(df2)

,pclass,sex,age,survived
name,,,,
"Allen, Miss. Elisabeth Walton",1,female,29.0000,NaN
"Allison, Master. Hudson Trevor",1,male,0.9167,NaN
"Allison, Miss. Helen Loraine",1,female,2.0000,NaN
"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000,NaN
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,0.0
"Anderson, Mr. Harry",1,male,48.0000,1.0
"Andrews, Miss. Kornelia Theodosia",1,female,63.0000,1.0
"Andrews, Mr. Thomas Jr",1,male,39.0000,0.0
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,female,53.0000,1.0
"Artagaveytia, Mr. Ramon",1,male,71.0000,0.0

In [119]:
df1.join(df2, how='inner')

,pclass,sex,age,survived
name,,,,
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0,0
"Anderson, Mr. Harry",1,male,48.0,1
"Andrews, Miss. Kornelia Theodosia",1,female,63.0,1
"Andrews, Mr. Thomas Jr",1,male,39.0,0
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,female,53.0,1
"Artagaveytia, Mr. Ramon",1,male,71.0,0

In [120]:
df2.join(df1)

,survived,pclass,sex,age
name,,,,
,1,NaN,NaN,NaN
"Kildong, Mr. Hong",1,NaN,NaN,NaN
,0,NaN,NaN,NaN
,0,NaN,NaN,NaN
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",0,1.0,female,25.0
"Anderson, Mr. Harry",1,1.0,male,48.0
"Andrews, Miss. Kornelia Theodosia",1,1.0,female,63.0
"Andrews, Mr. Thomas Jr",0,1.0,male,39.0
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,1.0,female,53.0
"Artagaveytia, Mr. Ramon",0,1.0,male,71.0

#Section 03. 조건 검색으로 데이터 추출
## 1. 불 인덱스로 조건 검색하기

In [ ]:
titanic_df[titanic_df['age']>70] # 70세 이상인 승객 검색

In [ ]:
titanic_df[titanic_df['age']<3] # 3세 미만인 승객 검색

In [ ]:
titanic_df[titanic_df['age']<3]['name'] # 3세 미만 승객의 이름 검색

In [ ]:
titanic_df[titanic_df['age']<3][['age', 'name']]

##2. loc 속성으로 조건 검색하기

In [ ]:
titanic_df.loc[titanic_df['age']<3]['name'] # 3세 미만 승객의 이름 검색

In [ ]:
titanic_df.loc[titanic_df['age']<3, 'name':'sex']

In [ ]:
titanic_df.loc[titanic_df['age']<3, ['name', 'sex']]

## 3. isin 함수로 조건 검색하기
- 자주 사용
- 중복 문자열 조회할 때, 자주 사용

In [ ]:
my_condition=['male']
my_condition

In [ ]:
titanic_df['sex'].isin(my_condition)

In [ ]:
titanic_df['name']

In [ ]:
my_condition1=['Braund, Mr. Owen Harris', 'Williams, Mr. Charles Duane']
my_condition1

In [ ]:
titanic_df['name'].isin(my_condition1)

##4. isin 함수와 loc 속성으로 조건 검색하기

In [ ]:
titanic_df.loc[titanic_df['name'].isin(my_condition1)]

In [ ]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), 'age']

In [ ]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), 'name']

In [ ]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), 'pclass':'age']

In [ ]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), ['pclass', 'age']]

##5. 검색 정보를 활용해 타이타닉 승객 구분하기

In [ ]:
titanic_df['name'][0]

In [ ]:
titanic_df['name'][0].split(',')[1]

In [ ]:
titanic_df['name'][0].split(',')[1].split('.')[0]

In [ ]:
titanic_df['name'][0].split(',')[1].split('.')[0].strip( )

In [ ]:
test=lambda x: x+2
test(2)
range(5) # 0, 1, 2, 3, 4

In [ ]:
list(map(test, range(5)))

In [ ]:
condition=lambda x: x.split(',')[1].split('.')[0].strip( )
titanic_df['title']=titanic_df['name'].map(condition)
titanic_df['title']

In [ ]:
titles=titanic_df['title'].unique( )
titles

In [ ]:
pd.crosstab( titanic_df['title'], titanic_df['sex'])

In [ ]:
Special=[ 'Master', 'Don', 'Rev']
for each in Special:
  titanic_df['title']=titanic_df['title'].replace(each, 'Special')
  
titanic_df['title'].unique( )

In [ ]:
print(titanic_df[['title', 'survived']].groupby(['title'], as_index=False).mean( ))